
// є масив [2,17,13,6,22,31,45,66,100,-18] :
//
//
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
//
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//
// 7. замінити кожне число, кратне 3, на слово “okten”
//
// 8. вивести масив у зворотньому порядку.
//
// 9. всі попередні завдання (окрім 8), але у зворотньому циклі (задом наперед)
//
//
//
// #yHAwJOyiC

let numbers =  [2,17,13,6,22,31,45,66,100,-18] ;
// i = 0
// while( i < numbers.length){
//     if(i % 2 != 0){console.log(numbers[i]);}
//     i++
// }
for (let j = 0; j < numbers.length; j++) {
    const number = numbers[j];
    if(number % 2 == 0){console.log(number);}
}
