
// є масив [2,17,13,6,22,31,45,66,100,-18] :
//
// 1. перебрати його циклом while
//
// 2. перебрати його циклом for
//
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
//
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
//
// 5. перебрати циклом while та вивести  числа тільки парні  значення
//
// 6. перебрати циклом for та вивести  числа тільки парні  значення
//
// 7. замінити кожне число, кратне 3, на слово “okten”
//
// 8. вивести масив у зворотньому порядку.
//
// 9. всі попередні завдання (окрім 8), але у зворотньому циклі (задом наперед)
//
//
//
// #yHAwJOyiC

let arr = [2,17,13,6,22,31,45,66,100,-18] ;
let i = 0;
while(i<arr.length) {console.log(arr[i]);
i++;
}
for (let j = 0; j < arr.length; j++) {
    const arrElement = arr[j];
    console.log(arrElement);

}
let user = 0;
while(user< arr.length) {
    if(user % 2 === 0){document.write(arr[user]);
    user++}
}
