
// Описати колоду карт (від 6 до туза без джокерів). Більшу частину колоди можна описати з використанням циклу

// Після опису, використовуючи функції масивів:

    // – знайти піковий туз
 //
 // – всі шістки

 // – всі червоні карти

// – всі бубни

 // – всі трефи від 9 та більше
// Приклад моделі об’єкту карти:
// {
//     cardSuit: ”, // ‘spade’, ‘diamond’,’heart’, ‘clubs’

    // value: ”, // ‘6’-’10’, ‘ace’,’jack,’queen’,’king’

    // color:”, // ‘red’,’black’

// }

let cardSuit = ['spade', 'diamond','heart','clubs' ];
let value = [6, 7, 8, 9, 10, 'ace','jack','queen','king'];
